In [ ]:
#read on how to do descriptive startistics and how to explain them
#read binomial graphs are qn structure

In [ ]:
"""
pmf is a representation of number and times a variable appears
histogram:
what is the diff btwn a pmf and a histogram? both can be transformed from on to another
"""

In [6]:
#importing pandas
import pandas as pd

In [26]:
#creat a data frame called df and importing the dataset
df=pd.read_excel(r'C:\Users\AND1\Desktop\DATA SCIENCE\DATA\dataset.xlsx')
print(df)

    S/N             student_names  age weight   height
0     1            Adokorac Nancy   20     74    177.8
1     2   Amutuhaire Faith Ahabwe   27     47   157.48
2     3     KWAGALA JOANNA VICTOR   21     54   185.42
3     4              mahoro cathy   23     30   185.42
4     5  Mbabazi Hawa Bint Edrisa   19     59   175.26
5     6       Nakanjako josephine   24     65   175.26
6     7            Nanteza Dorcus   21     69   157.48
7     8             Mbabazi Angel   19     57   167.64
8     9            Namara Racheal   19     55   154.94
9    10       Lwamulungi Sheillah   22     78   162.56
10   11           Nakawuka Sandra   25     60   175.26
11   12   Achola Gloria Fortunate   27     80   172.72
12   13             Nagawa Esther   21     58   188.42
13   14           wanjiku hananny   19     50    165.1
14   15            babirye Sandra   21     50   175.26
15   16          nakagga shanitah   21     50   175.26
16   17    Wembabazi Vivian Ritah   20     49   160.02
17   18   Nanziri Ritah Namayanja   23     70   162.56
18   19            Nasejje Mariam   20     62    101.6
19   20  Namukose Jolline Edriana   20     55   162.56
20   21      Agatha Faith Anyango   27     55    93.98
21   22              Kirabo Sarah   23     60    165.1
22   23          Nansalire Anitah   21     45     63.5
23   34             Nalugo gladys   19     70    101.6
24   25            Namakula Allen   20     55   170.18
25   26           Tukahirwa emily   22     67   175.26
26   27            Shamirah Ahmed   21     67   137.16
27   28          Ameso lmmaculate   23     64    165.1
28   29                Ayoo Teddy   20     50   157.48
29   30                Biira Mary   30     65   104.14
30   31        Aloyo Brenda Ojera   23     52   170.18
31   32        Ayebale Immaculate   24     50   162.56

In [27]:
#calculating the average or mean age
mean_age = df['age'].mean()
print(mean_age)

22.03125

In [28]:
#calculating the variation of the mean age
variance_age=df['age'].var()
print(variance_age)

7.644153225806452

In [29]:
#calculating the standard deviation of age
std_age=df['age'].std()
print(std_age)

2.7648061823220904

In [51]:
#calculating the mean of weight
mean_weight=df['weight'].mean()
print(mean_weight)

60.607142857142854

In [37]:


# Filter out non-numeric values in the "weight" column
df = df[pd.to_numeric(df['weight'], errors='coerce').notna()]

# Calculate the mean weight
mean_weight = df['weight'].mean()

print(mean_weight)

60.607142857142854

In [38]:

#calculating variance of the weight
variance_weight=df['weight'].var()
print(variance_weight)

80.09920634920634

In [39]:
#standard deviation of weight
std_weight=df['weight'].std()
print(std_weight)

8.949815995270871

In [46]:
#cleaning the heightcolumn because it was bringing an error of non numeric values
df['height'] = pd.to_numeric(df['height'], errors='coerce')
#calculating the mean height
mean_height=df['height'].mean()
print(mean_height)

In [48]:
#calculating the variance of height
var_height=df['height'].var()
print(var_height)

29.032200000000035

In [49]:
#calculating standard deviation of height
std_height=df['height'].std()
print(std_height)

5.388153672641495

In [9]:
df.head()#to print out the first values of the table

   S/N             student_names  age weight   height
0    1            Adokorac Nancy   20     74    177.8
1    2   Amutuhaire Faith Ahabwe   27     47   157.48
2    3     KWAGALA JOANNA VICTOR   21     54   185.42
3    4              mahoro cathy   23     30   185.42
4    5  Mbabazi Hawa Bint Edrisa   19     59   175.26

In [11]:
df.tail()#to print out the last five values of the table

    S/N       student_names  age weight   height
27   28    Ameso lmmaculate   23     64    165.1
28   29          Ayoo Teddy   20     50   157.48
29   30          Biira Mary   30     65   104.14
30   31  Aloyo Brenda Ojera   23     52   170.18
31   32  Ayebale Immaculate   24     50   162.56